negative_texts =  [
    "Сегодня ужасный день, полный горя и разочарований.",
    "Я расстроен просыпаться и начинать новый день с тяжёлым сердцем.",
    "Всё вокруг такое унылое и серое, словно природа печалится вместе со мной.",
    "Я разочарован во всех возможностях, которые дарит мне жизнь, и не вижу смысла использовать их.",
    "У меня нет настоящих друзей и близких, которые могли бы поддержать меня в трудную минуту.",
    "Мир так безысходен, и я печален, что я часть этого унылого мира.",
    "Я без энергии и не готов принять даже малейший вызов, который принесет этот день.",
    "У меня есть мечты, но я сомневаюсь, что они когда-либо сбудутся, потому что я не верю в себя и свои силы.",
    "Я разочарован в каждом моменте жизни и не готов делать его даже немного лучше.",
    "Я ненавижу себя и не ценю свою жизнь, и это делает меня несчастным.",
    "Сегодняшний день будет ужасным, потому что я не в состоянии создать свою судьбу и наполнять её радостью и любовью."
]