positive_texts  = [
    "Сегодня прекрасный день, полный радости и удивительных возможностей.",
    "Я рад проснуться и начать новый день с улыбкой на лице.",
    "Всё вокруг так красиво и ярко, словно природа сама радуется вместе со мной.",
    "Я благодарен за все возможности, которые дарит мне жизнь, и готов использовать их на полную мощность.",
    "У меня есть замечательные друзья и близкие, которые всегда поддержат меня в трудную минуту.",
    "Мир так прекрасен, и я рад, что я часть этого удивительного мира.",
    "Я полон энергии и готов принять все вызовы, которые принесет этот день.",
    "У меня есть мечты, и я знаю, что они сбудутся, потому что я верю в себя и свои силы.",
    "Я благодарен за каждый момент жизни и готов делать его еще более ярким и насыщенным.",
    "Я люблю себя и ценю свою жизнь, и это делает меня счастливым.",
    "Сегодняшний день будет прекрасным, потому что я сам создаю свою судьбу и наполняю ее радостью и любовью."
]